fabrika/src/InformationRegisters/НастройкаПолейОтправки/НастройкаПолейОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПолейОтправки</name>
  <attributes>
    <name>Видимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипДвиженияДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.ПолучателиДДС</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/Enums/ТипДвиженияДДС/ТипДвиженияДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДвиженияДДС</name>
  <enumValues>
    <name>ОстатокНаНачало</name>
  </enumValues>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>ОстатокНаКонец</name>
  </enumValues>
</mdclass:Enum>

fabrika/src/InformationRegisters/НастройкаПолейОтправки/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Получатель) Тогда
		ТекущийОбъект.Получатель = Неопределено;
		
	ИначеЕсли ТекущийОбъект.ТипДвижения = Перечисления.ТипДвиженияДДС.ОстатокНаНачало Тогда
		
		ОбщийМодульСервер.ДобавитьСоообщениеВмассив(, "Тип движения " + Запись.ТипДвижения + " не распределяется по получателям!!!");
		Отказ = Истина;
		
	ИначеЕсли ТекущийОбъект.ТипДвижения = Перечисления.ТипДвиженияДДС.Поступление И НЕ ВалютныйРасчёт(ТекущийОбъект.Получатель) Тогда 	
		ОбщийМодульСервер.ДобавитьСоообщениеВмассив(, "Тип движения " + Запись.ТипДвижения + " не распределяется по контрагентам!!!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ВалютныйРасчёт(Получатель)
	
	Если ТипЗнч(Получатель) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Получатель.ВалютныйРассчёт;
	
КонецФункции
